-- ### ASCII ART ###

--         header = [[
--
--  ▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒    ▒▓▓▓▓▒        ▒▓▓▓▓▒
--  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒    ▒▓▓▓▓▓       ▒▓▓▓▓▒
-- ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒      ▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▒
--                       ▓▓▓▓▓▓▓▓▓▓▓▓▓▒
--                         ▒▒▒▒▒▒▒▒
--  ▒▒▒▒▒▒
-- ▓▓▓▓▓▓▓
-- ▓▓▓▓▓▓▓▒               ▒▒▒▒▒▒▒
-- ▒▓▓▓▓▓▓▓▒            ▒▓▓▓▓▓▓▓▒
--  ▒▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▒
--   ▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒
--     ▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒
--         ]],
--         header = [[
-- ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗
-- ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║
-- ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║
-- ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║
-- ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║
-- ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝
--         ]],
--         header = [[
-- ░▒▓███████▓▒░░▒▓████████▓▒░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓██████████████▓▒░
-- ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░
-- ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░
-- ░▒▓█▓▒░░▒▓█▓▒░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░
-- ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░
-- ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░
-- ░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░▒▓██████▓▒░   ░▒▓██▓▒░  ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░
--         ]],
--         header = [[
--  ███▄    █ ▓█████  ▒█████   ██▒   █▓ ██▓ ███▄ ▄███▓
--  ██ ▀█   █ ▓█   ▀ ▒██▒  ██▒▓██░   █▒▓██▒▓██▒▀█▀ ██▒
-- ▓██  ▀█ ██▒▒███   ▒██░  ██▒ ▓██  █▒░▒██▒▓██    ▓██░
-- ▓██▒  ▐▌██▒▒▓█  ▄ ▒██   ██░  ▒██ █░░░██░▒██    ▒██
-- ▒██░   ▓██░░▒████▒░ ████▓▒░   ▒▀█░  ░██░▒██▒   ░██▒
-- ░ ▒░   ▒ ▒ ░░ ▒░ ░░ ▒░▒░▒░    ░ ▐░  ░▓  ░ ▒░   ░  ░
-- ░ ░░   ░ ▒░ ░ ░  ░  ░ ▒ ▒░    ░ ░░   ▒ ░░  ░      ░
--    ░   ░ ░    ░   ░ ░ ░ ▒       ░░   ▒ ░░      ░
--          ░    ░  ░    ░ ░        ░   ░         ░
--                                 ░
--         ]],
--         header = [[
--            ▄ ▄
--        ▄   ▄▄▄     ▄ ▄▄▄ ▄ ▄
--        █ ▄ █▄█ ▄▄▄ █ █▄█ █ █
--     ▄▄ █▄█▄▄▄█ █▄█▄█▄▄█▄▄█ █
--   ▄ █▄▄█ ▄ ▄▄ ▄█ ▄▄▄▄▄▄▄▄▄▄▄▄▄▄
--   █▄▄▄▄ ▄▄▄ █ ▄ ▄▄▄ ▄ ▄▄▄ ▄ ▄ █ ▄
-- ▄ █ █▄█ █▄█ █ █ █▄█ █ █▄█ ▄▄▄ █ █
-- █▄█ ▄ █▄▄█▄▄█ █ ▄▄█ █ ▄ █ █▄█▄█ █
--     █▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█ █▄█▄▄▄█
--         ]],

-- ### SIMPLE ###

-- return {
--   "folke/snacks.nvim",
--   priority = 1000,
--   lazy = false,
--   opts = {
--     dashboard = {
--       enabled = true,
--       preset = {
--         header = [[
--  ███▄    █ ▓█████  ▒█████   ██▒   █▓ ██▓ ███▄ ▄███▓
--  ██ ▀█   █ ▓█   ▀ ▒██▒  ██▒▓██░   █▒▓██▒▓██▒▀█▀ ██▒
-- ▓██  ▀█ ██▒▒███   ▒██░  ██▒ ▓██  █▒░▒██▒▓██    ▓██░
-- ▓██▒  ▐▌██▒▒▓█  ▄ ▒██   ██░  ▒██ █░░░██░▒██    ▒██
-- ▒██░   ▓██░░▒████▒░ ████▓▒░   ▒▀█░  ░██░▒██▒   ░██▒
-- ░ ▒░   ▒ ▒ ░░ ▒░ ░░ ▒░▒░▒░    ░ ▐░  ░▓  ░ ▒░   ░  ░
-- ░ ░░   ░ ▒░ ░ ░  ░  ░ ▒ ▒░    ░ ░░   ▒ ░░  ░      ░
--    ░   ░ ░    ░   ░ ░ ░ ▒       ░░   ▒ ░░      ░
--          ░    ░  ░    ░ ░        ░   ░         ░
--                                 ░
--         ]],
--       },
--       formats = {
--         header = {
--           align = "center",
--         },
--       },
--       sections = {
--         {
--           section = "header",
--           padding = 4,
--         },
--         {
--           pane = 2,
--           {
--             { section = "keys", gap = 1, padding = 2 },
--             { section = "startup" },
--           },
--         },
--       },
--     },
--   },
--   init = function()
--     vim.api.nvim_set_hl(0, "SnacksDashboardHeader", { fg = "#ffffff" })
--   end,
-- }

-- ### RECENTS ###

-- return {
--   "folke/snacks.nvim",
--   priority = 1000,
--   lazy = false,
--   opts = {
--     dashboard = {
--       preset = {
--         header = [[
--
--
--
-- ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗
-- ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║
-- ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║
-- ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║
-- ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║
-- ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝
--   ]],
--       },
--       formats = {
--         header = {
--           align = "center",
--         },
--       },
--       sections = {
--         {
--           section = "startup",
--           padding = 1,
--           enabled = function()
--             return not (vim.o.columns > 135)
--           end,
--         },
--         {
--           pane = 2,
--           indent = 0,
--           {
--             padding = 1,
--             { icon = " ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
--             { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
--             { icon = " ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
--             { icon = " ", key = "s", desc = "Restore Session", section = "session" },
--             { icon = " ", key = "q", desc = "Quit", action = ":qa" },
--           },
--           {
--             icon = " ",
--             title = "Recent Files",
--           },
--           {
--             section = "recent_files",
--             opts = {
--               limit = 5,
--             },
--             indent = 3,
--             padding = 1,
--           },
--           {
--             icon = " ",
--             title = "Projects",
--           },
--           {
--             section = "projects",
--             opts = {
--               limit = 3,
--             },
--             indent = 3,
--             padding = 1,
--           },
--         },
--         {
--           section = "header",
--           padding = 0,
--         },
--         -- {
--         --   pane = 1,
--         --   align = "center",
--         --   section = "terminal",
--         --   cmd = "cmatrix -C blue -u 8",
--         --   height = 11,
--         --   padding = 1,
--         -- },
--         -- {
--         --   pane = 1,
--         --   align = "center",
--         --   section = "terminal",
--         --   cmd = "pfetch",
--         --   height = 12,
--         --   padding = 1,
--         -- },
--         {
--           indent = 0,
--           title = "Maintenance Actions",
--         },
--         {
--           indent = 0,
--           {
--             icon = " ",
--             key = "c",
--             desc = "Config",
--             action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
--           },
--           { icon = "󰒲 ", key = "L", desc = "Lazy", action = ":Lazy", enabled = package.loaded.lazy ~= nil },
--           { icon = " ", key = "x", desc = "Lazy Extras", action = ":LazyExtras" },
--           { icon = "󱁤 ", key = "m", desc = "Mason", action = ":Mason" },
--         },
--       },
--     },
--   },
--   init = function()
--     vim.api.nvim_set_hl(0, "SnacksDashboardHeader", { fg = "#ffffff" })
--   end,
-- }

return {
  "folke/snacks.nvim",
  priority = 1000,
  lazy = false,
  opts = {
    dashboard = {
      preset = {
        header = [[
 ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗
 ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║
 ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║
 ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║
 ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║
 ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝
   ]],
      },
      formats = {
        header = {
          align = "center",
        },
      },
      sections = {
        -- Wide version (180 columns or more)
        {
          enabled = function()
            return (vim.o.columns >= 180)
          end,
          {
            section = "header",
            indent = 64,
          },
          {
            pane = 1,
            {
              { icon = " ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
              { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
              { icon = " ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
              { icon = " ", key = "s", desc = "Restore Session", section = "session" },
              {
                icon = " ",
                key = "c",
                desc = "Config",
                action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
              },
              { icon = "󰒲 ", key = "L", desc = "Lazy", action = ":Lazy", enabled = package.loaded.lazy ~= nil },
              { icon = " ", key = "x", desc = "Lazy Extras", action = ":LazyExtras" },
              { icon = "󱁤 ", key = "m", desc = "Mason", action = ":Mason" },
              { icon = " ", key = "q", desc = "Quit", action = ":qa" },
              padding = 5,
            },
            {
              section = "startup",
              indent = 64,
            },
          },
          {
            pane = 2,
            {
              padding = 8,
            },
            {
              icon = " ",
              title = "Recent Files",
              section = "recent_files",
              indent = 3,
              padding = 1,
            },
            {
              icon = " ",
              title = "Projects",
              section = "projects",
              indent = 3,
            },
          },
        },

        -- Slim version (less than 180 columns)
        {
          enabled = function()
            return (vim.o.columns < 180)
          end,
          {
            { section = "header" },
            {
              { icon = " ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
              { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
              { icon = " ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
              { icon = " ", key = "s", desc = "Restore Session", section = "session" },
              {
                icon = " ",
                key = "c",
                desc = "Config",
                action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
              },
              { icon = "󰒲 ", key = "L", desc = "Lazy", action = ":Lazy", enabled = package.loaded.lazy ~= nil },
              { icon = " ", key = "x", desc = "Lazy Extras", action = ":LazyExtras" },
              { icon = "󱁤 ", key = "m", desc = "Mason", action = ":Mason" },
              { icon = " ", key = "q", desc = "Quit", action = ":qa" },
              padding = 1,
            },
            {
              icon = " ",
              title = "Recent Files",
              section = "recent_files",
              indent = 3,
              padding = 1,
            },
            {
              icon = " ",
              title = "Projects",
              section = "projects",
              indent = 3,
              padding = 3,
            },
            {
              section = "startup",
            },
          },
        },
      },
    },
  },
  init = function()
    vim.api.nvim_set_hl(0, "SnacksDashboardHeader", { fg = "#ffffff" })
  end,
}
